Repository: Wilhelm-Zimmermann/HomeControllerHUB
Catalog: src/HomeControllerHUB.Globalization/Resources/SharedResource.*.resx
Languages: pt_br

# LoginInvalid
source: Username/Password are incorrect
pt_br: Nome do usuário/Senha estão incorretos

# TheRequestedLocationCouldNotBeFound
source: Location not found
pt_br: Localização não encontrada

# LocationHasChildren
source: This location has dependencies
pt_br: Essa localização possui dependências

# DeleteAllChildLocationsFirst
source: Delete all location dependencies first
pt_br: Apague todas as dependencias dessa localização primeiro

# LocationHasSensors
source: This location has sensors
pt_br: Essa localização possui sensores

# MoveSensorsBeforeDeleting
source: Move sensors before deleting it
pt_br: Mova os sensores antes de deletá-la

source: Invalid parent location
pt_br: Localização inválida

# LocationCannotBeItsOwnParent
source: Location cannot depend on itself
pt_br: Localização não pode depender dela mesma

# DeviceIdAlreadyInUse
source: Device id is already in use
pt_br: Id do dispositivo já está em uso

source: Sensor device id must be unique
pt_br: Id do sensor do dispositivo deve ser único

# TheRequestedLocationDoesNotBelongToTheEstablishment
source: The requested location does not belong to this establishment
pt_br: A localização requisitada não pertence a esse estabelecimento

source: Sensor not found
pt_br: Sensor não encontrado

source: Delete failed
pt_br: Falha na deleção

# SensorHasReadingsCannotBeDeleted
source: Sensor has readings and cannot be deleted
pt_br: Esse sensor possui leituras e não pode ser deletado.

# SensorHasAlertsCannotBeDeleted
source: Sensor has alerts and cannot be deleted
pt_br: Esse sensor possui alertas e não pode ser excluído

source: Authentication failed
pt_br: Falha na autenticação

source: Invalid API key
pt_br: Chave da API inválida

# SensorValueBelowThreshold
source: Sensor value is below the threshold
pt_br: Valor do sensor está abaixo do limite

# SensorValueAboveThreshold
source: Sensor value is above the theshold
pt_br: Valor do sensor está acima do limite

source: Validation failed
pt_br: Falha na validação

source: Establishment not found
pt_br: Estabelecimento não encontrado

source: Location not found
pt_br: Localização não encontrada

# SensorLowBattery
source: Sensor with low battery
pt_br: Sensor está com a bateria baixa

source: Invalid login
pt_br: Login inválido

source: Invalid refresh token
pt_br: "Refresh token" inválido

source: Invalid password
pt_br: Senha inválida

source: Unauthorized
pt_br: Não autorizado

source: Invalid token
pt_br: Token inválido
